Name: Krishna Vyas R

Registration Number: 21BAI1715

In [3]:
import numpy as np
import pandas as pd

Task - 1 
Create a pandas dataframe (DataFrame name as 'df')

In [5]:
data = {
    'Name' : ['Vyas','Hanuma','Aditya','Yashodhan','Shobith','Aasrith','Nidhish','Hrishi','Vignesh','Charan'],
    'Student_ID' : [1,2,3,4,5,6,7,8,9,10],
    'University' : ['VIT', 'IIT', 'SRM', 'BITS','BITS','VIT', 'IIT', 'SRM', 'VIT','IIT'],
    'Age':[18,19,20,21,20,18,19,20,21,np.nan],
    'Branch':['BAI','CSE','BPS','BMS','BAI','BAI','CSE','BPS','BMS','BRS'],
}
df=pd.DataFrame(data)
df

        Name  Student_ID University   Age Branch
0       Vyas           1        VIT  18.0    BAI
1     Hanuma           2        IIT  19.0    CSE
2     Aditya           3        SRM  20.0    BPS
3  Yashodhan           4       BITS  21.0    BMS
4    Shobith           5       BITS  20.0    BAI
5    Aasrith           6        VIT  18.0    BAI
6    Nidhish           7        IIT  19.0    CSE
7     Hrishi           8        SRM  20.0    BPS
8    Vignesh           9        VIT  21.0    BMS
9     Charan          10        IIT   NaN    BRS

Task- 2 
Check the info of 'df'

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   Student_ID  10 non-null     int64
 2   University  10 non-null     object
 3   Age         9 non-null      float64
 4   Branch      10 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 532.0+ bytes

Task 3- 
Check the descriptive statistics of 'df'

In [7]:
df.describe()

       Student_ID        Age
count    10.00000   9.000000
mean      5.50000  19.555556
std       3.02765   1.130388
min       1.00000  18.000000
25%       3.25000  19.000000
50%       5.50000  20.000000
75%       7.75000  20.000000
max      10.00000  21.000000

Task 4- 
check the 4th index observation with 'loc' slicing operator.

In [8]:
df.loc[4]

Name          Shobith
Student_ID          5
University       BITS
Age              20.0
Branch            BAI
Name: 4, dtype: object

Task 5 -
 i. Check the null values in your 'df'

In [9]:
df.isnull().sum()

Name          0
Student_ID    0
University    0
Age           1
Branch        0
dtype: int64

ii. Filling null values

In [10]:
df.Age=df.Age.fillna(df.Age.mean())
df

        Name  Student_ID University        Age Branch
0       Vyas           1        VIT  18.000000    BAI
1     Hanuma           2        IIT  19.000000    CSE
2     Aditya           3        SRM  20.000000    BPS
3  Yashodhan           4       BITS  21.000000    BMS
4    Shobith           5       BITS  20.000000    BAI
5    Aasrith           6        VIT  18.000000    BAI
6    Nidhish           7        IIT  19.000000    CSE
7     Hrishi           8        SRM  20.000000    BPS
8    Vignesh           9        VIT  21.000000    BMS
9     Charan          10        IIT  19.555556    BRS